ds.count() - ile rejestrów

ds.values_counts() - łączy i liczy te same wartości

ds.idxmin()/idxmax - index minimalnej/max wartości

ds.mean() - srednia

ds.median() - mediana

ds.std() - odchylenie standardowe

low_memory - dla True dzieli plik na częsci i procesuje oszczędzając pamięc - z False jest szybciej choć może zabraknąc pamięci

In [19]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

%matplotlib inline

In [20]:
programmers = pd.read_csv(r"..\course-files\StackOverflowDeveloperSurvey2018.csv", usecols=["ConvertedSalary"], low_memory=False).dropna()

In [21]:
programmers.head()

   ConvertedSalary
1          70841.0
4          21426.0
5          41671.0
6         120000.0
8         250000.0

In [22]:
programmers.mean()

ConvertedSalary    95780.861788
dtype: float64

In [23]:
programmers.median()

ConvertedSalary    55075.0
dtype: float64

In [24]:
programmers.std()

ConvertedSalary    202348.215625
dtype: float64

In [25]:
Salary = programmers.max()
Salary

ConvertedSalary    2000000.0
dtype: float64

In [26]:
fortune500 = pd.read_csv(r"..\course-files\Fortune_500_2017.csv", usecols=["Title", "Employees"], index_col="Title").dropna()

In [27]:
fortune500.head()

                    Employees
Title
Walmart               2300000
Berkshire Hathaway     367700
Apple                  116000
Exxon Mobil             72700
McKesson                68000

In [28]:
fortune500.idxmax()

Employees    Walmart
dtype: object

In [29]:
fortune500.loc[fortune500.idxmax()]

         Employees
Title
Walmart    2300000

In [30]:
fortune500.idxmin()

Employees    A-Mark Precious Metals
dtype: object

In [31]:
fortune500.loc[fortune500.idxmin()]

                        Employees
Title
A-Mark Precious Metals         83